cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/dupes'
tap 'thoughtbot/formulae'

brew 'autojump'
brew 'bash'
brew 'coreutils'
brew 'findutils'
brew 'git'
brew 'homebrew/dupes/grep'
brew 'trash'
brew 'rcm'
brew 'macvim', args: ['with-cscope', 'with-lua', 'with-override-system-vim']

# Applications
cask '1password'
cask 'alfred'
cask 'firefox'
cask 'flash'
cask 'flux'
cask 'google-chrome'
cask 'iterm2'
cask 'phpstorm'
cask 'qlcolorcode'
cask 'qlprettypatch'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'quicklook-json'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'sublime-text3'
cask 'vagrant'
cask 'virtualbox'
cask 'Caskroom/cask/vlc'
cask 'java' unless system '/usr/libexec/java_home --failfast'

# Fonts
cask 'font-liberation-mono-for-powerline'
cask 'font-meslo-lg-for-powerline'