cask_args appdir: '/Applications'

# Third-party taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/dupes'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/php'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'thoughtbot/formulae'
tap 'yudai/gotty'

# Tools and libraries
brew 'aria2'
brew 'awscli'
brew 'bash'
brew 'coreutils'
brew 'fasd'
brew 'findutils'
brew 'fpp'
brew 'git'
brew 'gotty'
brew 'gpg-agent'
brew 'gpg2'
brew 'heroku-toolbelt'
brew 'homebrew/dupes/grep'
brew 'httpie'
brew 'hub'
brew 'imagemagick'
brew 'jq'
brew 'keychain'
brew 'libyaml'
brew 'macvim', args: ['with-cscope', 'with-lua', 'with-override-system-vim']
brew 'node'
brew 'openssl'
brew 'php71'
brew 'pick'
brew 'pinentry-mac'
brew 'postgresql'
brew 'python'
brew 'rbenv'
brew 'rcm'
brew 'redis'
brew 'ruby-build'
brew 'the_silver_searcher'
brew 'tmux'
brew 'trash'

# Applications
cask '1password'
cask 'alfred'
cask 'bartender'
cask 'backblaze'
cask 'docker-beta'
cask 'fantastical'
cask 'firefox'
cask 'flash-player'
cask 'flux'
cask 'google-chrome'
cask 'iterm2-beta'
cask 'java7'
cask 'keepingyouawake'
cask 'micro-snitch'
cask 'paw'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-json'
cask 'radio-silence'
cask 'skype'
cask 'slack-beta'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text-dev'
cask 'typora'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'

# Fonts
cask 'font-liberation-mono-for-powerline'
cask 'font-meslo-lg-for-powerline'
cask 'font-monofur-for-powerline'
